{
  "1": { "text": "At last your two-day hike is over, You unsheathe your sword, lay it on the ground and sigh with relief as you lower yourself down on to the mossy rocks to sit for a moment's rest. You stretch, rub your eyes and finally look up at Firetop Mountain.\n The very mountain itself looks menacing. The steep face in front of you looks to have been savaged by the claws of some gargantuan beast. Sharp rocky crags jut out at unnatural angles. At the top of the mountain you can see the eerie red colouring - probably some strange vegetation - which has given the mountain its name. Perhaps no one will ever know exactly what grows up there, as climbing the peak must surely be impossible.\n Your quest lies ahead of you. Across the clearing is a dark cave entrance. You pick up your sword, get to your feet and consider what dangers may lie ahead of you. But with determination, you thrust the sword home into its scabbard and approach the cave.\n You peer into the gloom to see dark, slimy walls with pools of water on the stone floor in front of you. The air is cold and dank. You light your lantern and step warily into the blackness. Cobwebs brush your face and you hear the scurrying of tiny feet; rats, most likely. \n You set off into the cave. After a few yards you arrive at a junction. Will you turn west (1) or east (2)",
        "options": {"1": "71", "2": "278"},
        "actions": null},
  "2": {"text": "Test your Luck. If you are Lucky, you escape without attracting the Ogre's attention. lf you are Unlucky, you curse as you kick a small stone which goes skidding across the cavern floor. You draw your sword In case the Ogre has heard it - turn to 16. If you were Lucky, you creep down the corridor back to the crossroads. Turn to 269.",
        "options": {"1": "", "2": ""},
        "actions": "test_luck"},
  "3": {"text": "The bell gives a dull clang and after a few moments you see a withered old man climb into a small rowing boat moored on the north bank. He rows slowly across to you, moors the boat and limps towards you. Hc asks you for 3 Gold Pieces. When you protest at the price he mumbles some flimsy excuse about 'inflation' He begins to get angry at your protestations. Do you pay him thc 3 Gold Pieces (1) or threaten him (2)?",
        "options": {"1": "222", "2": "127"}},
  "4": {"text": "You find yourself in a north-south corridor. To the north the passage turns east some metres ahead. To investigate, (1). To the south, the passageway also turns east. (2) to go south",
        "options": {"1": "46", "2": "332"}},
  "5": {"text": "A rough timber doorway is on the east wall of the passage. You listen at the door and can hear a jolly sort of humming sound. Do you want to knock on the door and go in (1) or will you continue northwards? (2)?",
        "options": {"1": "97", "2": "292"}},
  "6": {"text": "The large solid door has no handle. You charge it, but to no avail. The door is not going to budge. You decide to give up and go through the opening you passed in the east west passageway some way back. (1)",
        "options": {"1": "89"}},
  "7": {"text": "You are on the north bank of a fast-flowing river in a large underground cavern. (1) to continue.",
        "options": {"1": "214"}},
  "8": {"text": "The passage ahead ends at a sturdy door- You listen but hear nothing. You try the handle, it turns, and you enter the room. As you look around you hear aloud cry from behind you and swing round to see a wild man leaping towards you wielding a large battle axe. He is a mad BARBARIAN and you must fight him!\n\nBARBARIAN: SKILL 7 STAMINA 6\n\n There is a door in the north wall opposite, through which you may escape(during the battle)!",
        "options": {},
        "fight": {"name": "barbarian",
                  "skill": 7,
                  "stamina": 6,
                  "escape": 189,
                  "win": 273}},
  "9": {"text": "Amazed at the success of your bluff, you decide to push your luck a little further. You can either examine the Skeletons' tools or pretend you're looking for work-sheets and look through the drawers of the various benches. (1) If you choose the tools. (2) If you want to search the drawers.\n You hear a noise from behind the north door and realize you will have to hurry!",
        "options": {"1": "34", "2": "322"}},
  "10": {"text": "You arrive back at the junction and turn northwards, (1) to continue.",
        "options": {"1": "77", "2": ""}},
  "n": {"text": "",
        "options": {"1": "", "2": ""}}
}